#Δύο παίκτες Α και Β παίζουν το εξής παιχνίδι: 
#Ο Α διαλέγει έναν μυστικό αριθμό στο διάστημα [0, 1000] 
#και ο Β πρέπει να τον μαντέψει. Ο Β μπορεί να λέει έναν 
#αριθμό και ο Α πρέπει να απαντήσει αν ο μυστικός αριθμός 
#είναι μικρότερος, ίσος ή μεγαλύτερος από αυτόν. 
#Φτιάξτε ένα πρόγραμμα που να βοηθάει τον Β να βρεί τον 
#μυστικό αριθμό χρησιμοποιώντας το πολύ 10 προσπάθειες.

def A(x):
# Η σύναρτηση που δίνει την απάντηση του Α αν ο Β έχει 
# απαντήσει τον αριθμό x 
    return number - x

def f():
# ορισμός της  συνάρτησης που βοηθάει τον Β να επιλέξει
    i = 0
    j = 1000
    guesses = 0
    while i <= j:
        m = (i + j)//2
        comp = A(m)
        guesses += 1
        if comp == 0:
            return (m, guesses)
        elif comp > 0:
            i = m + 1
        else:
            j = m - 1
    return (-1, guesses)
  	

# Κυρίως πρόγραμμα
number = int(input("Give number to guess: "))

print("Found number %s in %s guesses" % f())
