# -*- coding: utf-8 -*-
####
#############################################################
# FUNCTIONS #

'''
Φτιάξτε τη συνάρτηση my_less που να δέχεται ως ορίσματα 2 φυσικούς.
Η συνάρτηση θα πρέπει να συγκρίνει τους αριθμούς και να επιστρέφει
True ή False, με τον ακόλουθο τρόπο. Οι περιττοί αριθμοί θα προηγού-
νται από τους άρτιους. Έτσι αν ο a είναι περιττός και ο b άρτιος τότε
θα επιστρέφει True, ενώ αν ο a είναι άρτιος και ο b περιττός τότε θα
επιστρέφει False.
Στην περίπτωση που και οι δύο αριθμοί είναι είτε άρτιοι ή περιττοί τότε
γίνεται η συνηθισμένη σύγκριση ”μικρότερο”, ”<”, μεταξύ δύο αριθμών.
Έτσι αν a, b είναι και οι δύο άρτιοι ή περιττοί και ο a είναι μικρότερος
από το b επιστρέφει True, διαφορετικά False.
Φτιάξτε μια συνάρτηση που θα ταξινομεί την L, χρησιμοποιώντας τη σχέση ”μικρότερο” που ορίζεται από τη συνάρτηση my_less που έχεται δημιουργήσει παραπάνω. '''

#############################################################


    
