#### ’σκηση:
####
#### Στο αρχείο με όνομα numbers.txt (το οποίο πρέπει να κατεβάσετε και να βάλετε στο ίδιο
#### directory με τα user.py, tester,py) υπάρχει ένας πραγματικός αριθμός σε κάθε γραμμή.
#### Το πρόγραμμά σας θα πρέπει να διαβάζει ένα ακέραιο N>=0 από το χρήστη και να υπολογίζει
#### στη μεταβλητή result το άθροισμα των N πρώτων γραμμών του αρχείου. Αν το N είναι μεγαλύτερο
#### από τον αριθμό γραμμών του αρχείου τότε πρέπει να υπολογίζει το άθροισμα όλων των γραμμών.
####
#### *** Παράδειγμα: ***
####
#### Αν N=0 τότε result=0, ενώ αν N=5 τότε result=5.3 (κοιτάξτε και το αρχείο numbers.txt)
####
