# -*- coding: utf-8 -*-

#### Άσκηση: Γράψτε μια συνάρτηση σε python:
####
####    def fromfile(s)
####
#### όπου s είναι ένα string με το όνομα ενός αρχείου. Το αρχείο έχει ένα μη αρνητικό ακέραιο αριθμό N
#### στην πρώτη του γραμμή και στη δεύτερη γραμμή έχει πολλούς ακεραίους διαχωρισμένους με κενά.
#### Η συνάρτησή σας θα πρέπει να επιστρέφει μια λίστα με τους N πρώτους ακεραίους της 2ης γραμμής,
#### με την αντίστροφη σειρά που αυτοί εμφανίζονται στο αρχείο.
####
#### Θα πρέπει να κατεβάσετε και τα αρχεία numbers1.txt, numbers2.txt και numbers3.txt στον ίδιο κατάλογο με το user.py.
####


filename = "numbers1.txt"

def fromfile(s):
    f = open(s,"r")
    r = f.readlines()
    N = int(r[0])
    l2= r[1].split()
    n = []
    for x in range(N):
        print(x)
        n.append(l2[x])
    return n

print(fromfile(filename))
