#Θέλουμε να τυπώσουμε n γραμμές και 
#i γραμμή θα έχει 2i-1 αστεράκια, δηλαδή για n=4
#	 *
#	***
#  *****
# *******
# Φτιάξτε μια συνάρτηση (χρησιμοποιώντας επανάληψη) που να
# υλοποιεί το προηγούμενο


'''ΕΞΗΓΗΣΗ: Το πρώτο επίπεδο έχει ένα αστεράκι, το δεύτερο,
τρία και εν γένει το i -στό επίπεδο θα έχει 2i − 1 αστεράκια. Όλα αυτά πρέπει να
εκτυπωθούν σε ένα πεδίο πλάτους 2n − 1 . Eπειδή
2n − 1 − (2i − 1) = (n − i) + (n − i) εκτυπώνουμε n − i κενούς χαρακτήρες
ακολουθούμενους από 2i − 1 αστεράκια. '''


