# -*- coding: utf-8 -*-


#### Άσκηση: Γράψτε μια συνάρτηση σε python:
####    def addamounts(s)
#### η οποία παίρνει ένα string s και επιστρέφει το άθροισμα όλων των ποσών (τριψήφια νούμερα) που εμφανίζονται
#### δίπλα στο string s σε μια γραμμή του αρχείου amounts.txt.
####
#### Το αρχείο amounts.txt θα πρέπει να το έχετε αποθηκευμένο στο ίδιο directory με τα αρχεία user.py και tester.py.
####
#### Για παράδειγμα, αν s="91Z7ATSF6T" τότε η συνάρτησή σας θα πρέπει να επιστρέφει 22174.
####
#### Θα χρειαστεί να χρησιμοποιήσετε τη μέθοδο x.split() η οποία επιστρέφει μια λίστα από strings, τις "λέξεις" του
#### string x αν θεωρήσουμε τους λευκούς χαρακτήρες ως διαχωριστικούς.

