# -*- coding: utf-8 -*-


#### Άσκηση: Γράψτε μια συνάρτηση σε python:
####
####    def getlist(D)
####
#### όπου D είναι ένα λεξικό με κλειδιά ακεραίους αριθμούς. Οι τιμή κάθε κλειδιού είναι μια λίστα ακεραίων.
#### Η συνάρτησή σας θα πρέπει να επιστρέφει μια λίστα που περιέχει (με οποιαδήποτε σειρά)
#### εκείνα τα κλειδιά του λεξικού D των οποίων η τιμή είναι μια λίστα με άρτιο μήκος.
####
#### Για παράδειγμα, αν D = { 1: [10, 20], 2: [], 3: [2], 4: [1, 2, 3] } τότε το αποτέλεσμα είναι
####  [ 1, 2 ] (η μια οποιαδήποτε αναδιάταξη αυτής της λίστας).
####

D = eval(input("Give a dictionary with integers as keys and lists of integers as values: "))

def getlist(D):
    d = []
    for x in D:
        if len(D[x]) / 2 == len(D[x]) // 2:  # len(D[x]) % 2 == 0
            d.append(x)
    return d

print(getlist(D))
