# -*- coding: utf-8 -*-


#### Άσκηση: Γράψτε μια συνάρτηση σε python:
####
####    def process(D1, D2)
####
#### όπου D1, D2 είναι δύο λεξικά όπου οι τιμές είναι ακέραιοι και έχουν το ίδιο σύνολο κλειδιών.
#### Η συναρτησή σας θα πρεπει να επιστρέφει ένα λεξικό που να έχει τα ίδια κλειδιά με τα D1, D2
#### και όπου η τιμή του κάθε κλειδιού είναι η μέγιστη από τις δύο τιμές του κλειδιού στα D1, D2.
####
#### Για παράδειγμα αν D1={1:1, 2:3, 3:4, 4:1, 5:3} και D2={1:2, 2:1, 3:-1, 4:4, 5:3}
#### τότε το αποτέλεσμα πρέπει να είναι το λεξικό
####    {1:2, 2:3, 3:4, 4:4, 5:3}.
####

dd1 = { 1: 2, 2: 2, -1: 1, 3: 1, 4: 10}
dd2 = { 1: 3, 2: 1, -1: 0, 3: 2, 4: 0}

#### Υποθέσεις:
####  Στο σημείο αυτό έχουν πάρει τιμή τα λεξικά dd1, dd2 με τα οποία θα κληθεί η συνάρτησή σας.
#### 
#### Απαιτήσεις:
####  Στο τέλος του προγράμματός σας θα πρέπει η συνάρτηση να επιστρέφει αυτό που περιγράφεται παραπάνω.


def process(d1, d2):
    d3 = {}
    for x in d1:        
        if d1[x] > d2[x]:
            d3[x] = d1[x]
        else:
            d3[x] = d2[x]
    return d3

print(process(dd1,dd2))