# -*- coding: utf-8 -*-

#### Άσκηση: Γράψτε μια συνάρτηση σε python:
####
####    def process(D, value)
####
#### όπου D είναι ένα λεξικό όπου η τιμή του κάθε κλειδιού είναι ακέραιος και value είναι ένας ακέραιος.
#### Η συναρτησή σας θα πρεπει να επιστρέφει ένα λεξικό που είναι ίδιο με το D εκτός από τα κλειδιά των
#### οποίων η τιμή είναι ίση με value, τα οποία πετιούνται (δε συμπεριλαμβάνονται στο επιστρεφόμενο λεξικό).
####
#
dd = { 1: 2, 2: 2, -1: 1, 3: 1, 4: 10}
vv = 1

#### Υποθέσεις:
####  Στο σημείο αυτό έχει πάρει τιμή το λεξικό dd και η τιμή vv με τα οποία θα κληθεί η συνάρτησή σας.
#### 
#### Απαιτήσεις:
####  Στο τέλος του προγράμματός σας θα πρέπει η συνάρτηση να επιστρέφει αυτό που περιγράφεται παραπάνω.

def process(d, v):
    d3 = {}
    for x in d:
        if d[x] == v:
            pass
        else:
            d3[x] = d[x]
    return d3


print(process(dd, vv))