# -*- coding: utf-8 -*-
####ID e2-3-2-problem

#### Άσκηση: Γράψτε μια συνάρτηση σε python:
####
####    def process(D1, D2}
####
#### όπου D1, D2 είναι δύο λεξικά όπου οι τιμές είναι ακέραιοι.
#### Η συναρτησή σας θα πρεπει να επιστρέφει ένα λεξικό του οποίου τα κλειδιά είναι όσα κλειδιά
#### υπάρχουν στο D1 ή στο D2 (η ένωση των δύο συνόλων κλειδιών με άλλα λόγια)
#### και όπου η τιμή του κάθε κλειδιού στο λεξικό που επιστρέφετε είναι η τιμή του στο D1, αν υπάρχει στο D1,
#### αλλιώς η τιμή του στο D2.
####
#### Για παράδειγμα αν D1={1:1, 2:3, 3:4} και D2={3:-1, 4:4, 5:3}
#### τότε το αποτέλεσμα πρέπει να είναι το λεξικό
####    {1:1, 2:3, 3:4, 4:4, 5:3}.
####


dd1 = {1:1, 2:3, 3:4}
dd2 = {3:-1, 4:4, 5:3}

#### Υποθέσεις:
####  Στο σημείο αυτό έχουν πάρει τιμή τα λεξικά dd1, dd2 με τα οποία θα κληθεί η συνάρτησή σας.
#### 
#### Απαιτήσεις:
####  Στο τέλος του προγράμματός σας θα πρέπει η συνάρτηση να επιστρέφει αυτό που περιγράφεται παραπάνω.



def f1(d1,d2):
    d3={}
            d3[x] = d2[x]
    for x in d1:
        d3[x] = d1[x]
    for x in d2:
        if x not in d3:

    return d3


print(f1(dd1,dd2))