#Φτιάξτε μια συνάρτηση η οποία να δέχεται ως όρισμα 
#ένα λεξικό. Τα κλειδιά του λεξικού είναι τα ονόματα 
#φοιτητών. Οι τιμές του λεξικού είναι ένα άλλο λεξικό που 
#περιέχει ως κλειδιά τα μαθήματα που έχει περάσει ο 
#φοιτητής και τιμές τους αντίστοιχους βαθμούς. 
#Π.χ. d={"Mike":{"MEM107":6, "MEM108":9}, 
#        "Peter":{"MEM105":6, "MEM107":9}}.
# Η συνάρτηση θα επιστρέφει δύο λίστες, στην πρώτη θα είναι 
# τα ονόματα φοιτητών και στη δεύτερη ο μέσος όρος των 
# βαθμών των μαθημάτων που έχει περάσει ο αντίστοιχος 
# φοιτητής της πρώτης λίστας. Οι λίστες θα είναι 
# ταξινομημένες αλφαβητικά με τη μέθοδο selection sort.
   
def f(L):
# ορισμός της συνάρτησης
    
  	
# Κυρίως πρόγραμμα
L = eval(input("Give dict of names and grades: "))
